
* Load data into GRASS
  :PROPERTIES:
  :session:  *grass*
  :END:


** Start GRASS session

#+BEGIN_SRC sh :results silent
  # module add grass
  grass64 -text data/grass/nlcd/PERMANENT
  export GRASS_MESSAGE_FORMAT=plain
#+END_SRC

*** TODO write emacs-lisp to start a new *grass* shell

** Load NLCD data

#+BEGIN_SRC sh :results verbatim
  r.in.gdal --overwrite \
      input=data/NLCD2006_landcover_4-20-11_se5/nlcd2006_landcover_4-20-11_se5.img \
      output=nlcd2006
#+END_SRC

#+RESULTS:
: Projection of input dataset and current location appear to match
: 2..5..8..11..14..17..20..23..26..29..32..35..38..41..44..47..50..53..56..59..62..65..68..71..74..77..80..83..86..89..92..95..98..100
: r.in.gdal complete. Raster map <nlcd2006> created.

